app/controllers/user_controller.rb

INSERT INTO `users` (`created_at`, `updated_at`, `password`, `screen_name`, `email`) VALUES('2012-11-23 04:22:43', '2012-11-23 04:22:43', 'gdfgdfgfg', 'ggfgfgdgg', 'dfgdfgdfg@fdfd.com')
---
  def register
  @title = "Register"
  if request.post?
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`password` = 'dhass' AND `users`.`screen_name` = 'dhass') LIMIT 1
---
def login
@title = "Log in to RailsSpace"
if request.post? and params[:user]
  @user = User.new(params[:user])
  user = User.find_by_screen_name_and_password(@user.screen_name,@user.password)